{
    "key" : "D02",
    "keyTH" : "ทร44.",
    "text" : "<b>กลุ่มที่ 1 กลุ่มโรคมะเร็ง</b><br>1. โรคมะเร็ง<br><b>กลุ่มที่ 2 กลุ่มโรคเกี่ยวกับตับและตับอ่อน</b><br>2. โรคตับวาย<br>3. โรคไวรัสตับอักเสบชนิดรุนแรง<br>4. โรคภาวะตับอ่อนอักเสบที่กลับเป็นซ้ำและเรื้อรัง<br><b>กลุ่มที่ 3 กลุ่มโรคเลือด/อวัยวะสร้างเลือด/ความผิดปกติเกี่ยวกับกลไกของภูมิคุ้มกัน</b> <br>5. โรคโลหิตจางจากไขกระดูกไม่สร้างเม็ดโลหิต<br>6. โรคภูมิแพ้ตัวเองชนิดซีสเต็มมิค ลูปุส อิริเธมาโตซูส<br><b>กลุ่มที่ 4 กลุ่มโรคเกี่ยวกับระบบประสาท</b><br>7. โรคอัลไซม์เมอร์<br>8. โรคระบบประสาทมัลติเพิลสะคลีโรลิส<br>9. การสูญเสียความสามารถในการพูด<br>10. โรคเซลล์ประสาทยนต์<br>11. ภาวะสมองใหญ่ไม่สามารถควบคุมการทำงานของร่างกายตามปกติอย่างถาวร<br>12. การฉีกขาดหลายรากของข่ายประสาท<br>13. โรคระบบประสาทพาร์กินสัน<br>14. การสูญเสียการได้ยินอย่างสมบูรณ์<br>15. โรคเยื่อหุ้มสมองอักเสบและไขสันหลังอักเสบจากเชื้อแบคทีเรีย<br>16. สมองอักเสบจากเชื้อไวรัส<br>17. โรคน้ำไขสันหลังในสมองมากซึ่งเกิดจากภายหลังและต้องใส่ท่อระบายน้ำ *<br><b>กลุ่มที่ 5 กลุ่มโรคปอดอักเสบ/โรคอื่นๆของปอด</b> <br>18. ความดันเลือดสูงของเส้นเลือดแดงในปอดชนิดปฐมภูมิ<br>19. โรคปอดระยะสุดท้าย<br><b>กลุ่มที่ 6 กลุ่มโรคความดันเลือดสูง/โรคเส้นเลือดในสมอง</b> <br>20. อัมพาตจากโรคเส้นเลือดสมอง<br>21. โรคเส้นเลือดสมองที่ต้องได้รับการผ่าตัดลอกเส้นเลือดแดงคาโรติก<br>22. การผ่าตัดสมองอันเนื่องมาจากโรคเส้นเลือดสมองโป่งพอง<br><b>กลุ่มที่ 7 กลุ่มโรคหัวใจ</b> <br>23. โรคกล้ามเนื้อหัวใจตายชนิดเฉียบพัน<br>24. การผ่าตัดเปลี่ยนลิ้นหัวใจ<br>25. การผ่าตัดเส้นเลือดเลี้ยงกล้ามเนื้อหัวใจ<br>26. โรคไข้รูห์มาติกที่ทำให้หัวใจผิดปกติ *<br>27. โรคคาวาซากิที่ทำให้เกิดโรคแซกซ้อนของหัวใจ *<br>28. โรคกล้ามเนื้อหัวใจ<br><b>กลุ่มที่ 8 กลุ่มโรคอื่นๆ</b> <br>29. เนื้องอกในสมอง ชนิดที่ไม่ใช่มะเร็ง<br>30. โรคลำใส้อักเสบเป็นแผล<br>31. การผ่าตัดเส้นเลือดแดงใหญ่<br>32. โรคเนื้อเยื่อพังผืดอักเสบติดเชื้อและเป็นเนื้อตาย<br>33. การผ่าตัดเปลี่ยนอวัยวะ<br>34. ไตวายเรื้อรังระยะสุดท้าย<br>35. โรคเบาหวานในเด็ก *<br>36. โปลิโอ<br>37. โรคกล้ามเนื้อเสื่อม<br>38. แผลการไหม้และน้ำร้อนลวก<br>39. การสลบหรือหมดความรูู้สึก<br>40. โรคเท้าช้าง<br>41. ภาวะข้ออักเสบรูมาตอยด์ชนิดรุนแรง<br>42. การสูญเสียการดำรงชีพอย่างอิสระ<br>43. การผ่าตัดกระดูกสันหลังที่เกิดสภาพโค้งงอโดยไม่ทราบสาเหตุ<br>44. การบาดเจ็บที่ศีรษะอย่างรุนแรง",
    "annotation": "* หมายถึง โรคร้ายแรงที่สัญญาเพิ่มเติมฉบับนี้จะให้ความคุ้มครอง ก็ต่อเมื่อ โรคดังกล่าวนั้นได้เกิดขึ้นครั้งแรก ก่อนที่ผู้เอาประกันภัยจะมีอายุครบ 17 ปีบริบูรณ์เท่านั้น"
}