export default {
  "name": "เลดี้ วีแคร์ (Lady We Care)",
  "info": null,
  "summary": [
    {
      "type": "item",
      "title": "ความคุ้มครอง",
      "items": [
        {
          "name": "การเสียชีวิต สูญเสียอวัยวะ สายตา หรือทุพพลภาพถาวรสิ้นเชิง (DD&TPD)",
          "percentIncome": null,
          "income": "{{income1}}"
        },
        {
          "name": "การรักษาพยาบาลต่ออุบัติเหตุแต่ละครั้ง(ME)",
          "percentIncome": null,
          "income": "{{income2}}"
        },
        {
          "name": "ขยายความคุ้มครองการขับขี่ หรือโดยสารรถจักรยานยนต์ (MC)",
          "percentIncome": null,
          "income": "{{income3}}"
        },
        {
          "name": "ขยายความคุ้มครองการถูกฆาตกรรม หรือถูกทำร้ายร่างกาย (MA)",
          "percentIncome": null,
          "income": "{{income4}}"
        },
        {
          "name": "ผลประโยชน์เพิ่มเติมกระดูกแตกหัก การไหม้ น้ำร้อนลวก และการบาดเจ็บอวัยวะภายใน (BB)",
          "percentIncome": null,
          "income": "{{income5}}"
        }
      ]
    },
    {
      "type": "condition",
      "items": [
        "เพื่อสิทธิประโยชน์สูงสุดของท่าน ควรถือกรมธรรม์จนครบกำหนกดสัญญา และผลประโยชน์ที่ได้รับจากกรมธรรม์ประกันชีวิตจะไม่มีการหักภาษีใดๆทั้งสิ้น และเป็นเงินปลอดหนี้เจ้าหนี้ไม่มีสิทธิ์ยึดได้ ยกเว้นเท่าจำนวนเบี้ยประกันภัยที่จ่ายไปเท่านั้น",
        "การนำส่งเบี้ยประกันภัยเป็นหน้าที่ของผู้เอาประกันภัย การที่ตัวแทนประกันชีวิตเก็บเบี้ยประกันภัยเป็นการให้บริการเท่านั้น โดยท่านสามารถชำระเบี้ยประกันภัยงวดต่อไปผ่านช่องทางต่างๆ เช่น สาขา, ที่ทำการไปรษณีย์, เคาน์เตอร์เซอร์วิส, ธนาคาร ฯลฯ หรือศึกษาข้อมูลเพิ่มเติมได้จากคู่มือผู้เอาประกันภัย",
        "ควรศึกษาข้อมูลก่อนการตัดสินใจ อีกทั้งต้องแถลงข้อมูลตามความเป็นจริงในเอกสารขอเอาประกันภัย เพื่อผลประโยชน์สูงสุดของท่าน \"เอกสารนี้เป็นเพียงการสรุปผลประโยชน์โดยสังเขป และขอสงวนสิทธิ์ในการพิจารณารับประกันตามหลักเกณฑ์ของบริษัทฯ ทั้งนี้เงื่อนไขและความคุ้มครองอย่างสมบูรณ์จะถูกระบุอยู่ในกรมธรรม์ที่ท่านซื้อไว้เท่านั้น\""
      ]
    }
  ],
  "calculate": (sum, prospect, utils, quatation) => {
    //TODO: tfpan => แผน
    let fixpan = quatation.package == undefined || quatation.package == null ? 1 : quatation.package;

    let fixocc = prospect.occupationType;

    let TL2 = "";
    let TL3 = "";
    let TL4 = "";
    let TL5 = "";
    let TL6 = "";

    if (fixocc == "1" || fixocc == "2")
		{
			if (fixpan == "1")
			{
				TL2 = "400,000";
				TL3 = "";
				TL4 = "200,000";
				TL5 = "400,000";
				TL6 = "80,000";
			}
			if (fixpan == "2")
			{
				TL2 = "600,000";
				TL3 = "";
				TL4 = "300,000";
				TL5 = "600,000";
				TL6 = "120,000";
			}
			if (fixpan == "3")
			{
				TL2 = "800,000";
				TL3 = "80,000";
				TL4 = "400,000";
				TL5 = "800,000";
				TL6 = "160,000";
			}
			if (fixpan == "4")
			{
				TL2 = "1,000,000";
				TL3 = "100,000";
				TL4 = "500,000";
				TL5 = "1,000,000";
				TL6 = "200,000";
			}
			if (fixpan == "5")
			{
				TL2 = "1,200,000";
				TL3 = "120,000";
				TL4 = "600,000";
				TL5 = "1,200,000";
				TL6 = "200,000";
			}
			if (fixpan == "6")
			{
				TL2 = "700,000";
				TL3 = "70,000";
				TL4 = "350,000";
				TL5 = "700,000";
				TL6 = "140,000";
			}
		}
		else if (fixocc == "3")
		{
			if (fixpan == "1")
			{
				TL2 = "200,000";
				TL3 = "10,000";
				TL4 = "100,000";
				TL5 = "200,000";
				TL6 = "20,000";
			}
			if (fixpan == "2")
			{
				TL2 = "300,000";
				TL3 = "15,000";
				TL4 = "150,000";
				TL5 = "300,000";
				TL6 = "30,000";
			}
		}

    return {
      income1: TL2,
      income2: TL3,
      income3: TL4,
      income4: TL5,
      income5: TL6
    }
  }
}