export const TextModal = {
    SCREEN4_1_29: { title: "คำเตือน", text: "ท่านไม่สามารถนำเสนอขายลูกค้ารายนี้ได้ \nเนื่องจากลูกค้าท่านนี้อยู่ในกลุ่ม Do Not Call List \nซึ่งได้แจ้งชื่อของดการนำเสนอขายกับบริษัทฯ", type: 29,redText: "ทั้งนี้ ท่านสามารถนำเสนอขายลูกค้ารายนี้ได้อีกครั้ง \nหลังจากวันที่ {{value}}"},
    SCREEN4_1_32: { title: "คำเตือน", text: "ผู้มุ่งหวัง ของท่านจัดอยู่ในกลุ่ม \"ลูกค้าเปราะบาง\" \nกลุ่มลูกค้าเปราะบาง: ลูกค้าที่มีอายุตั้งแต่ 60 ปีขึ้นไป \nหรือ มีเฉพาะบัญชีเงินฝากธนาคารต้องให้คำแนะนำอย่าง \nระมัดะวังเป็นพิเศษ ท่านควรเสนอขายผลิตภัณฑ์ และ\nแนะนำการลงทุนที่เหมาะสมกับกลุ่มลูกค้าเปราะบาง"},
    SCREEN4_1_37: { title: "ท่านกรอกข้อมูลไม่ครบ", text: "โปรดกรอกคำนำหน้าชื่อ, ชื่อ, นามสกุล, \nเบอร์มือถือ และ/หรือ เลขประจำตัวประชาชน \nเพื่อใช้ในการตรวจสอบ Do Not Call List"},
    SCREEN4_1_38: { title: "ท่านกรอกข้อมูลไม่ครบ", text: "โปรดกรอกข้อมูลประสบการณ์ด้านการลงทุน"},
    SCREEN4_1_40: { title: "กรุณาตรวจสอบ Do Not Call List", text: "กรุณาเลือกรายชื่อเพื่อยืนยันการตรวจสอบอีกครั้ง" , type: 40,redText: "คุณ {{value1}} เลขที่บัตร {{value2}}"},
    SCREEN4_1_41: {title: "คำเตือน", text: "กรุณาระบุข้อมูลก่อนหน้าให้สมบูรณ์ก่อน"},
    wn_alert_1: {title: "คำเตือน", text: "เบี้ยเพิ่มพิเศษต้องไม่น้อยกว่า 10,000"},
    wn_alert_2: {title: "คำเตือน", text: "ระบุอายุไม่สัมพันธ์กัน"},
    wn_alert_3: {title: "คำเตือน", text: "ระบุอายุน้อยกว่าอายุปัจจุบัน"},
    wn_alert_4: {title: "คำเตือน", text: "เบี้ยเพิ่มพิเศษต้องไม่เกิน 120,000,000"}
}