export default {
  "name": "พี.เอ. คลาสสิคแคร์",
  "info": null,
  "summary": [
    {
      "type": "item",
      "title": "ความคุ้มครอง",
      "items": [
        {
          "name": "การเสียชีวิต สูญเสียอวัยวะ สายตา หรือทุพพลภาพถาวรสิ้นเชิง (DD&TPD)",
          "percentIncome": null,
          "income": "{{income1}}"
        },
        {
          "name": "การรักษาพยาบาลต่ออุบัติเหตุแต่ละครั้ง(ME)",
          "percentIncome": null,
          "income": "{{income2}}"
        },
        {
          "name": "ขยายความคุ้มครอง การขับขี่หรือโดยสารรถจักรยานยนต์ (MC)",
          "percentIncome": null,
          "income": "{{income3}}"
        },
        {
          "name": "ขยายความคุ้มครอง การถูกฆาตรกรรมหรือถูกทำร้ายร่างกาย (MA)",
          "percentIncome": null,
          "income": "{{income4}}"
        }
      ]
    },
    {
      "type": "condition",
      "items": [
        "เพื่อสิทธิประโยชน์สูงสุดของท่าน ควรถือกรมธรรม์จนครบกำหนกดสัญญา และผลประโยชน์ที่ได้รับจากกรมธรรม์ประกันชีวิตจะไม่มีการหักภาษีใดๆทั้งสิ้น และเป็นเงินปลอดหนี้เจ้าหนี้ไม่มีสิทธิ์ยึดได้ ยกเว้นเท่าจำนวนเบี้ยประกันภัยที่จ่ายไปเท่านั้น",
        "การนำส่งเบี้ยประกันภัยเป็นหน้าที่ของผู้เอาประกันภัย การที่ตัวแทนประกันชีวิตเก็บเบี้ยประกันภัยเป็นการให้บริการเท่านั้น โดยท่านสามารถชำระเบี้ยประกันภัยงวดต่อไปผ่านช่องทางต่างๆ เช่น สาขา, ที่ทำการไปรษณีย์, เคาน์เตอร์เซอร์วิส, ธนาคาร ฯลฯ หรือศึกษาข้อมูลเพิ่มเติมได้จากคู่มือผู้เอาประกันภัย",
        "ควรศึกษาข้อมูลก่อนการตัดสินใจ อีกทั้งต้องแถลงข้อมูลตามความเป็นจริงในเอกสารขอเอาประกันภัย เพื่อผลประโยชน์สูงสุดของท่าน \"เอกสารนี้เป็นเพียงการสรุปผลประโยชน์โดยสังเขป และขอสงวนสิทธิ์ในการพิจารณารับประกันตามหลักเกณฑ์ของบริษัทฯ ทั้งนี้เงื่อนไขและความคุ้มครองอย่างสมบูรณ์จะถูกระบุอยู่ในกรมธรรม์ที่ท่านซื้อไว้เท่านั้น\""
      ]
    }
  ],
  "calculate": (sum, prospect, utils, quatation) => {
		//TODO: tfpan => แผน
		
    let fixpan = quatation.package == undefined || quatation.package == null ? 1 : quatation.package;

    let fixocc = prospect.occupationType;

    let TJ2 = "";
    let TJ3 = "";
    let TJ4 = "";
    let TJ5 = "";

    if (fixocc == "1")
		{
			if (fixpan == "1")
			{
				TJ2 = "200,000";
				TJ3 = "20,000";
				TJ4 = "100,000";
				TJ5 = "200,000";
			}
			if (fixpan == "2")
			{
				TJ2 = "300,000";
				TJ3 = "30,000";
				TJ4 = "150,000";
				TJ5 = "300,000";
			}
			if (fixpan == "3")
			{
				TJ2 = "400,000";
				TJ3 = "60,000";
				TJ4 = "200,000";
				TJ5 = "400,000";
			}
			if (fixpan == "4")
			{
				TJ2 = "500,000";
				TJ3 = "70,000";
				TJ4 = "250,000";
				TJ5 = "500,000";
			}
			if (fixpan == "5")
			{
				TJ2 = "700,000";
				TJ3 = "80,000";
				TJ4 = "350,000";
				TJ5 = "700,000";
			}
		}
		if (fixocc == "2")
		{
			if (fixpan == "1")
			{
				TJ2 = "200,000";
				TJ3 = "10,000";
				TJ4 = "100,000";
				TJ5 = "200,000";
			}
			if (fixpan == "2")
			{
				TJ2 = "300,000";
				TJ3 = "20,000";
				TJ4 = "150,000";
				TJ5 = "300,000";
			}
			if (fixpan == "3")
			{
				TJ2 = "400,000";
				TJ3 = "50,000";
				TJ4 = "200,000";
				TJ5 = "400,000";
			}
			if (fixpan == "4")
			{
				TJ2 = "500,000";
				TJ3 = "60,000";
				TJ4 = "250,000";
				TJ5 = "500,000";
			}
			if (fixpan == "5")
			{
				TJ2 = "700,000";
				TJ3 = "70,000";
				TJ4 = "350,000";
				TJ5 = "700,000";
			}
		}
		if (fixocc == "3")
		{				
			if (fixpan == "1")
			{
				TJ2 = "200,000";
				TJ3 = "8,000";
				TJ4 = "100,000";
				TJ5 = "200,000";
			}
			if (fixpan == "2")
			{
				TJ2 = "300,000";
				TJ3 = "16,000";
				TJ4 = "150,000";
				TJ5 = "300,000";
			}
		}

    return {
      income1: TJ2,
      income2: TJ3,
      income3: TJ4,
      income4: TJ5
    }
  }
}