export default {
    "name": "เกษมสิน 2",
    "info": {
      "section1": null,
      "section2": {
        "css": {
          "height": "134px"
        },
        "data": [{
          "type": "text",
          "value": "ความคุ้มครอง",
          "class": "protection-txt"
        },{
          "type": "text",
          "value": "{{data2_1}}  บาท",
          "css": {
            "margin-top": " -2px",
            "margin-left": "260px",
            "font-size": "24px",
            "z-index": "2"
          }
        },
        {
          "type": "text",
          "value": "หรือ เงินค่าเวนคืนกรมธรรม์ หรือ เบี้ยประกันภัยสําหรับการประกันชีวิต",
          "css": {
            "margin-top": " 21px",
            "margin-left": "145px",
            "font-size": "16px",
            "z-index": "2"
          }
        },
        {
          "type": "text",
          "value": "ที่ได้ชำระให้แก่บริษัทมาแล้วทั้งหมด ตามจํานวนที่มากกว่า",
          "css": {
            "margin-top": " 40px",
            "margin-left": "145px",
            "font-size": "16px",
            "z-index": "2"
          }
        },
          {
          "type": "text",
          "value": "{{data3_1}}  บาท",
          "css": {
            "margin-top": "-2px",
            "margin-left": "620px",
            "font-size": "24px",
            "z-index": "2"
          }
        },{
          "type": "text",
          "value": "หรือ เงินค่าเวนคืนกรมธรรม์ หรือ เบี้ยประกันภัยสําหรับการ",
          "css": {
            "margin-top": " 21px",
            "margin-left": "525px",
            "font-size": "16px",
            "z-index": "2"
          }
        },
        {
          "type": "text",
          "value": "ประกันชีวิตที่ได้ชำระให้แก่บริษัทมาแล้วทั้งหมด ตามจํานวนที่มากกว่า",
          "css": {
            "margin-top": " 40px",
            "margin-left": "525px",
            "font-size": "16px",
            "z-index": "2"
          }
        }, {
          "type": "text",
          "value": "วันครบรอบปี กรมธรรม์ที่",
          "class": "policy-year-text"
        }, {
          "type": "image",
          "value": "assets/img/projectform/graph/01/graph_WN2.png",
          "class": "section2-graph"
        }]
      },
      "section3": {
        "css": {
          "height": "100px"
        },
        "data": [{
          "type": "image",
          "value": "assets/img/projectform/money_bag.png",
          "css": {
            "margin-left": "823px"
          }
        }, {
          "type": "text",
          "value": "{{data3_1}}**",
          "class": "money-bag-data",
          "css": {
            "margin-left": "777px"
          }
        }]
      }
    },
    "summary": [
      {
        "type": "item",
        "title": "สรุปผลประโยชน์ตลอดสัญญา",
        "items": [
          {
            "name": "ครบสัญญา รับเงินครบสัญญา**",
            "percentIncome": "120%*",
            "income": "{{income1}}"
          }
        ]
      },
      {
        "type": "note",
        "items": [
          {
            "icon": "up",
            "color": "c-red",
            "message": "ครบระยะชำระเบี้ยประกันภัย"
          },
          {
            "iconText": "*",
            "color": "c-blue",
            "message": "อัตราร้อยละของจำนวนเงินเอาประกันภัย"
          },
          {
            "iconText": "**",
            "color": "c-blue",
            "message": "หากเบี้ยประกันภัยสําหรับการประกันชีวิตที่ได้ชําระให้แก่บริษัทมาแล้วทั้งหมดไม่รวมเบี้ยประกันภัยของสัญญาเพิ่มเติม (ถ้ามี) มีจํานวนมากกว่าเงินครบกําหนดสัญญาข้างต้น บริษัทจะจ่ายเงินครบสัญญาตามจํานวนที่มากกว่า"
          }
          
        ]
      },
      {
        "type": "condition",
        "items": [
          "เพื่อสิทธิประโยชน์สูงสุดของท่าน ควรถือกรมธรรม์จนครบกำหนดสัญญา และผลประโยชน์ที่ได้รับจากกรมธรรม์ประกันชีวิตจะไม่มีการหักภาษีใดๆทั้งสิ้น และเป็นเงินปลอดหนี้ เจ้าหนี้ไม่มีสิทธิ์ยึดได้ ยกเว้นเท่าจำนวนเบี้ยประกันภัยที่จ่ายไปเท่านั้น",
          "การนำส่งเบี้ยประกันภัยเป็นหน้าที่ของผู้เอาประกันภัย การที่ตัวแทนประกันชีวิตเก็บเบี้ยประกันภัยเป็นการให้บริการเท่านั้น โดยท่านสามารถชำระเบี้ยประกันภัยงวดต่อไปผ่านช่องทางต่างๆ เช่น สาขา, ที่ทำการไปรษณีย์, เคาน์เตอร์เซอร์วิส, ธนาคาร ฯลฯ หรือศึกษาข้อมูลเพิ่มเติมได้จากคู่มือผู้เอาประกันภัย",
          "เบี้ยประกันชีวิตสามารถนำไปหักค่าลดหย่อนภาษีเงินได้บุคคลธรรมดาตามกฎหมายตามจำนวนที่จ่ายจริง แต่ไม่่เกินปีละ 100,000 บาท (ตามประกาศอธิบดีกรมสรรพากรเกี่ยวกับภาษีเงินได้ฉบับที่ 172)",
          "ควรศึกษาข้อมูลก่อนการตัดสินใจ อีกทั้งต้องแถลงข้อมูลตามความเป็นจริงในเอกสารขอเอาประกันภัย เพื่อผลประโยชน์สูงสุดของท่าน \"เอกสารนี้เป็นเพียงการสรุปผลประโยชน์โดยสังเขป และขอสงวนสิทธิ์ในการพิจารณารับประกันตามหลักเกณฑ์ของบริษัทฯ ทั้งนี้เงื่อนไขและความคุ้มครองอย่างสมบูรณ์จะถูกระบุอยู่ในกรมธรรม์ที่ท่านซื้อไว้เท่านั้น\""
        ]
      }
    ],
    "calculate": (sum, prospect, utils) => {
      const val0 = utils.numFormat(sum);
      const val1 = utils.numFormat(Math.round( utils.formatInt( sum )  * 1.2 ));	
      const val2 = utils.numFormat(Math.round( utils.formatInt( sum )  * 1.2 ));		
  
      return {
        data2_1: val0,
        data3_1: val1,
        income1: val2
        
      }
    }
}
