export default {
  "name": "ทรัพย์บำนาญ60 (90/60)",
  "info": {
    "section1": null,
    "section2": {
      "css": {
        "height": "134px"
      },
      "data": [{
        "type": "text",
        "value": "ความคุ้มครอง",
        "class": "protection-txt"
      }, {
        "type": "text",
        "value": "{{data2_1}}",
        "css": {
          "margin-top": "18px",
          "margin-left": "155px",
          "width": "130px",
          "font-size": "20px",
          "z-index": "2"
        }
      }, {
        "type": "text",
        "value": "บาท",
        "css": {
          "margin-top": "18px",
          "margin-left": "260px",
          "font-size": "20px",
          "z-index": "2"
        }
      }, {
        "type": "text",
        "value": "หรือเงินค่าเวนคืนกรมธรรม์ที่มากกว่า",
        "css": {
          "margin-top": "18px",
          "margin-left": "290px",
          "color": "#853807",
          
          "font-size": "20px",
          "z-index": "2"
        }
      }, {
        "type": "text",
        "value": "มูลค่าปัจจุบันของเงินบำนาญที่เหลืออยู่**",
        "css": {
          "margin-top": "20px",
          "margin-left": "510px",
          
          "font-size": "18px",
          "z-index": "2"
        }
      }, {
        "type": "text",
        "value": "วันครบรอบปี กรมธรรม์ที่",
        "class": "policy-year-text"
      }, {
        "type": "image",
        "value": "assets/img/projectform/graph/02/02_graph28.png",
        "class": "section2-graph"
      }]
    },
    "section3": {
      "css": {
        "height": "40px"
      },
      "data": [{
        "type": "image",
        "value": "assets/img/projectform/02_table2.png",
        "class": "section3-table"
      }, {
        "type": "text",
        "value": "เงินบำนาญ***",
        "css": {
          "margin-top": "8px",
          "margin-left": "40px",
          "font-size": "22px",
          "width": "75px",
          "line-height": "13px"
        }
      }, {
        "type": "text",
        "value": "{{data3_1}}",
        "class": "section3-table-data",
        "css": {
          "margin-top": "2px",
          "margin-left": "486px"
        }
      }, {
        "type": "text",
        "value": "{{data3_2}}",
        "class": "section3-table-data",
        "css": {
          "margin-top": "17px",
          "margin-left": "552px"
        }
      }, {
        "type": "text",
        "value": "{{data3_3}}",
        "class": "section3-table-data",
        "css": {
          "margin-top": "2px",
          "margin-left": "618px"
        }
      }, {
        "type": "text",
        "value": "{{data3_4}}",
        "class": "section3-table-data",
        "css": {
          "margin-top": "17px",
          "margin-left": "683px"
        }
      }, {
        "type": "text",
        "value": "{{data3_5}}",
        "class": "section3-table-data",
        "css": {
          "margin-top": "2px",
          "margin-left": "747px"
        }
      }, {
        "type": "text",
        "value": "{{data3_6}}",
        "class": "section3-table-data",
        "css": {
          "margin-top": "17px",
          "margin-left": "865px"
        }
      }]
    }
  },
  "summary": [
    {
      "type": "item",
      "title": "สรุปผลประโยชน์ตลอดสัญญา",
      "items": [
        {
          "name": "ตั้งแต่วันครบรอบปีกรมธรรม์ที่อายุ 60 ปี ถึงอายุ 90 ปี",
          "percentIncome": null,
          "income": null,
          "subItems": [
            {
              "name": "รับเงินบำนาญ ปีละ",
              "percentIncome": "10%*",
              "income": "{{income1}}"
            },
            {
              "name": "รวมรับเงินบำนาญรายปีตลอดสัญญาสูงสุด 31 ปี",
              "percentIncome": "310%*",
              "income": "{{income2}}"
            }
          ]
        }
      ]
    },
    {
      "type": "note",
      "items": [
        {
          "icon": "up",
          "color": "c-red",
          "message": "ครบระยะชำระเบี้ยประกันภัย"
        },
        {
          "iconText": "*",
          "color": "c-blue",
          "message": "อัตราร้อยละของจำนวนเงินเอาประกันภัย"
        },
        {
          "iconText": "**",
          "color": "c-blue",
          "message": "หากผู้เอาประกันภัยเสียชีวิตโดยที่ยังได้รับเงินบำนาญไม่ครบ 15 ปี บริษัทฯ จะจ่ายเงินบำนาญที่เหลืออยู่ในครั้งเดียวให้ โดยมูลค่าจะเท่ากับมูลค่าปัจจุบันของจำนวนเงินบำนาญที่ยังไม่ได้จ่ายจนครบ 15 ปี"
        },
        {
          "iconText": "***",
          "color": "c-blue",
          "message": "ผู้เอาประกันภัยสามารถเลือกรับเงินบำนาญเป็นรายปี ปีละ 0 บาท ตั้งแต่วันครบรอบปีกรมธรรม์ที่ผู้เอาประกันภัยอายุครบ 60 ปี ไปจนถึงวันครบรอบปีกรมธรรม์ที่อายุครบ 90 ปี"
        }
      ]
    },
    {
      "type": "condition",
      "items": [
        "เพื่อสิทธิประโยชน์สูงสุดของท่าน ควรถือกรมธรรม์จนครบกำหนดสัญญา และผลประโยชน์ที่ได้รับจากกรมธรรม์ประกันชีวิตจะไม่มีการหักภาษีใดๆทั้งสิ้น และเป็นเงินปลอดหนี้เจ้าหนี้ไม่มีสิทธิ์ยึดได้ ยกเว้นเท่าจำนวนเบี้ยประกันภัยที่จ่ายไปเท่านั้น",
        "การนำส่งเบี้ยประกันภัยเป็นหน้าที่ของผู้เอาประกันภัย การที่ตัวแทนประกันชีวิตเก็บเบี้ยประกันภัยเป็นการให้บริการเท่านั้น โดยท่านสามารถชำระเบี้ยประกันภัยงวดต่อไปผ่านช่องทางต่างๆ เช่น สาขา, ที่ทำการไปรษณีย์, เคาน์เตอร์เซอร์วิส, ธนาคาร ฯลฯ หรือศึกษาข้อมูลเพิ่มเติมได้จากคู่มือผู้เอาประกันภัย",
        "เบี้ยประกันชีวิตสามารถนำไปหักค่าลดหย่อนภาษีเงินได้บุคคลธรรมดาตามกฎหมายตามจำนวนที่จ่ายจริง แต่ไม่่เกินปีละ 100,000 บาท (ตามประกาศอธิบดีกรมสรรพากรเกี่ยวกับภาษีเงินได้ฉบับที่ 172)",
        "เบี้ยประกันชีวิตแบบบำนาญสามารถนำไปหักค่าลดหย่อนภาษีเงินได้บุคคลธรรมดาตามกฎหมายตามจำนวนที่จ่ายจริงเพิ่มขึ้นอีกไม่เกินปีละ 200,000 บาท (ตามประกาศอธิบดีกรมสรรพากรเกี่ยวกับภาษีเงินได้ฉบับที่ 194)",
        "ควรศึกษาข้อมูลก่อนการตัดสินใจ อีกทั้งต้องแถลงข้อมูลตามความเป็นจริงในเอกสารขอเอาประกันภัย เพื่อผลประโยชน์สูงสุดของท่าน \"เอกสารนี้เป็นเพียงการสรุปผลประโยชน์โดยสังเขป และขอสงวนสิทธิ์ในการพิจารณารับประกันตามหลักเกณฑ์ของบริษัทฯ ทั้งนี้เงื่อนไขและความคุ้มครองอย่างสมบูรณ์จะถูกระบุอยู่ในกรมธรรม์ที่ท่านซื้อไว้เท่านั้น\""
      ]
    }
  ]
}
