export default {
    "name": "ตะกาฟุล 15/15",
    "info": {
      "section1": null,
      "section2": {
        "css": {
          "height": "140px"
        },
        "data": [{
          "type": "text",
          "value": "ความคุ้มครอง",
          "class": "protection-txt"
        },{
          "type": "text",
          "value": "รับฮิบะห์เท่ากับจำนวนเงินหลักประกันตะกาฟุล + เงินปันผลจ่ายเมื่อสัญญาสิ้นสุด (ถ้ามี)",
          "css": {
            "margin-top": " 27px",
            "margin-left": "255px",
            "font-size": "23px",
            "z-index": "2"
          }
        }, {
          "type": "text",
          "value": "วันครบรอบปี สัญญาตะกาฟุลที่",
          "class": "policy-year-text"
        }, {
          "type": "image",
          "value": "assets/img/projectform/graph/05/05_graph8.png",
          "class": "section2-graph"
        }]
      },
      "section3": {
        "css": {
          "height": "100px"
        },
        "data": [{
          "type": "image",
          "value": "assets/img/projectform/money_bag.png",
          "css": {
            "margin-left": "815px"
          }
        }, {
          "type": "text",
          "value": "{{data3_1}}",
          "class": "money-bag-data",
          "css": {
            "margin-left": "780px"
          }
        }]
      }
    },
    "summary": [
      {
        "type": "item",
        "title": "สรุปผลประโยชน์ตลอดสัญญา",
        "items": [
          {
            "name": "ครบสัญญา รับฮิบะห์เท่ากับจำนวนเงินค่าเวนคืนสัญญาตะกาฟุล ณ วันครบกำหนดสัญญา พร้อมเงินปันผลจ่ายเมื่อสัญญาสิ้นสุด (ถ้ามี)",
            "percentIncome": "100%*",
            "income": "{{income1}}"
          }
        ]
      },
      {
        "type": "note",
        "items": [
          {
            "iconText": "*",
            "color": "c-blue",
            "message": "อัตราร้อยละของจำนวนเงินหลักประกันตะกาฟุล"
          }/*,
          {
            "iconText": "**",
            "color": "c-blue",
            "message": "บริษัทฯ จะแจ้งเตือนอัตราการจ่ายเงินปันผล(ถ้ามี)ให้ทราบล่วงหน้าก่อนวันครบกำหนดสัญญา"
          }*/
        ]
      },
      {
        "type": "condition",
        "items": [
          "เพื่อสิทธิประโยชน์สูงสุดของท่าน ควรถือสัญญาตะกาฟุลจนครบกำหนดสัญญา",
          "การนำส่งเงินสมทบตะกาฟุล เป็นหน้าที่ของสมาชิกตะกาฟุล การที่ตัวแทนบริษัทฯ เก็บเงินสมทบตะกาฟุลเป็นการให้บริการเท่านั้นโดยท่านสามารถชำระเงินสมทบตะกาฟุลงวดต่อไปผ่านช่องทางต่างๆ เช่น สาขา, ที่ทำการไปรษณีย์, เคาน์เตอร์ เซอร์วิส, ธนาคาร, ฯลฯ หรือศึกษาข้อมูลเพิ่มเติมได้จากคู่มือเอกสิทธิ์",
          "เงินสมทบตะกาฟุลสามารถนำไปหักค่าลดหย่อนภาษีเงินได้บุคคลธรรมดาตามกฎหมายตามจำนวนที่จ่ายจริง แต่ไม่่เกินปีละ 100,000 บาท (ตามประกาศอธิบดีกรมสรรพากรเกี่ยวกับภาษีเงินได้ ฉบับที่ 172)",
          "ควรศึกษาข้อมูลก่อนการตัดสินใจ อีกทั้งต้องแถลงข้อมูลตามความเป็นจริงในเอกสารใบคำขอเป็นสมาชิกตะกาฟุล เพื่อผลประโยชน์สูงสุดของท่าน \"เอกสารนี้เป็นเพียงการสรุปผลประโยชน์โดยสังเขป และขอสงวนสิทธิ์ในการพิจารณาทำสัญญาตามหลักเกณฑ์ของบริษัทฯ ทั้งนี้เงื่อนไขและความคุ้มครองอย่างสมบูรณ์จะถูกระบุอยู่ในสัญญาตะกาฟุลที่ท่านซื้อไว้เท่านั้น\""
        ]
      }
    ],
    "calculate": (sum, prospect, utils, quatation) => {
  
      // จำนวนเงินคืน 100% ของทุนประกัน
      const val0 = utils.numFormat(sum) ;											
  
      return {
        data3_1: val0,
        income1: val0
      }
    }
}