export default {
  "name": "มะเร็ง รีฟันด์",
  "info": null,
  "summary": [
    {
      "type": "item",
      "title": "ความคุ้มครอง",
      "items": [
        {
          "name": "กรณีเสียชีวิต ทุกกรณี",
          "percentIncome": null,
          "income": "{{income1}}"
        },
        {
          "name": "โรคมะเร็งทุกชนิดทุกระยะ (ยกเว้นมะเร็งผิวหนัง)",
          "percentIncome": null,
          "income": "{{income2}}"
        },
        {
          "name": "โรคมะเร็งผิวหนัง",
          "percentIncome": null,
          "income": "{{income3}}"
        },
        {
          "name": "การชดเชยค่ารักษาพยาบาลรายวัน (วันละ)",
          "percentIncome": null,
          "income": "{{income4}}"
        }
      ]
    },
    {
      "type": "plain_text",
      "text": "ผลประโยชน์จ่ายคืนเบี้ยประกันภัย\n" +
      "\tหากกรมธรรม์ประกันภัยมีผลบังคับอย่างต่อเนื่องตามระยะเวลาเอาประกันภัย 5 ปี โดยไม่มีการเรียกร้องสินไหมทดแทน การจ่ายเงินทดแทนสำหรับโรคมะเร็ง บริษัทฯ จะจ่ายคืนเบี้ยประกันภัยรายปีเป็นจำนวน 1 ปีให้แก่ผู้เอาประกันภัย โดยจะจ่ายให้ในวันครบกำหนดสัญญา"
    },
    {
      "type": "condition",
      "items": [
        "เพื่อสิทธิประโยชน์สูงสุดของท่าน ควรถือกรมธรรม์จนครบกำหนกดสัญญา และผลประโยชน์ที่ได้รับจากกรมธรรม์ประกันชีวิตจะไม่มีการหักภาษีใดๆทั้งสิ้น และเป็นเงินปลอดหนี้เจ้าหนี้ไม่มีสิทธิ์ยึดได้ ยกเว้นเท่าจำนวนเบี้ยประกันภัยที่จ่ายไปเท่านั้น",
        "การนำส่งเบี้ยประกันภัยเป็นหน้าที่ของผู้เอาประกันภัย การที่ตัวแทนประกันชีวิตเก็บเบี้ยประกันภัยเป็นการให้บริการเท่านั้น โดยท่านสามารถชำระเบี้ยประกันภัยงวดต่อไปผ่านช่องทางต่างๆ เช่น สาขา, ที่ทำการไปรษณีย์, เคาน์เตอร์เซอร์วิส, ธนาคาร ฯลฯ หรือศึกษาข้อมูลเพิ่มเติมได้จากคู่มือผู้เอาประกันภัย",
        "ควรศึกษาข้อมูลก่อนการตัดสินใจ อีกทั้งต้องแถลงข้อมูลตามความเป็นจริงในเอกสารขอเอาประกันภัย เพื่อผลประโยชน์สูงสุดของท่าน \"เอกสารนี้เป็นเพียงการสรุปผลประโยชน์โดยสังเขป และขอสงวนสิทธิ์ในการพิจารณารับประกันตามหลักเกณฑ์ของบริษัทฯ ทั้งนี้เงื่อนไขและความคุ้มครองอย่างสมบูรณ์จะถูกระบุอยู่ในกรมธรรม์ที่ท่านซื้อไว้เท่านั้น\""
      ]
    }
  ],
  "calculate": (sum, prospect, utils, quatation) => {
    
    let fixpan = quatation.package == undefined || quatation.package == null ? 1 : quatation.package;
    let TE03_1 = "";
    let TE03_2 = "";
    let TE03_3 = "";

    if (fixpan == 1)
		{
			TE03_1 = "300,000";
			TE03_2 = "30,000";
			TE03_3 = "1,000";
		}
		if (fixpan == 2)
		{
			TE03_1 = "500,000";
			TE03_2 = "50,000";
			TE03_3 = "1,000";
		}
		if (fixpan == 3)
		{
			TE03_1 = "1,000,000";
			TE03_2 = "100,000";
			TE03_3 = "1,000";
		}

    return {
      income1: utils.numFormat(sum),
      income2: TE03_1,
      income3: TE03_2,
      income4: TE03_3
    }
  }
}