export default {
    "name": "คุ้มทรัพย์ 1/1",
    "info": {
      "section1": null,
      "section2": {
        "css": {
          "height": "134px"
        },
        "data": [{
          "type": "text",
          "value": "ความคุ้มครอง",
          "class": "protection-txt"
        },{
          "type": "text",
          "value": "{{data2_1}}",
          "css": {
            "margin-top": " 24px",
            "margin-left": "340px",
            "font-size": "24px",
            "color": "#c41a1c",
            "z-index": "2"
          }
        },{
          "type": "text",
          "value": "บาท",
          "css": {
            "margin-top": "25px",
            "margin-left": "550px",
            "font-size": "24px",
            "z-index": "2"
          }
        }, {
          "type": "text",
          "value": "วันครบรอบปี กรมธรรม์ที่",
          "class": "policy-year-text"
        }, {
          "type": "image",
          "value": "assets/img/projectform/graph/01/01_graphTE07.png",
          "class": "section2-graph"
        }]
      },
      "section3": null
    },
    "summary": [
      {
        "type": "item",
        "title": "สรุปผลประโยชน์ตลอดสัญญา",
        "items": [
          {
            "name": "คุ้มครองชีวิตตลอดสัญญา",
            "percentIncome": null,
            "income": "{{income1}}"
          }
        ]
      },
      {
        "type": "condition",
        "items": [
          "เพื่อสิทธิประโยชน์สูงสุดของท่าน ควรถือกรมธรรม์จนครบกำหนดสัญญา และผลประโยชน์ที่ได้รับจากกรมธรรม์ประกันชีวิตจะไม่มีการหักภาษีใดๆทั้งสิ้น และเป็นเงินปลอดหนี้เจ้าหนี้ไม่มีสิทธิ์ยึดได้ ยกเว้นเท่าจำนวนเบี้ยประกันภัยที่จ่ายไปเท่านั้น",
          "การนำส่งเบี้ยประกันภัยเป็นหน้าที่ของผู้เอาประกันภัย การที่ตัวแทนประกันชีวิตเก็บเบี้ยประกันภัยเป็นการให้บริการเท่านั้น ",
          "ควรศึกษาข้อมูลก่อนการตัดสินใจ อีกทั้งต้องแถลงข้อมูลตามความเป็นจริงในเอกสารขอเอาประกันภัย เพื่อผลประโยชน์สูงสุดของท่าน \"เอกสารนี้เป็นเพียงการสรุปผลประโยชน์โดยสังเขป และขอสงวนสิทธิ์ในการพิจารณารับประกันตามหลักเกณฑ์ของบริษัทฯ ทั้งนี้เงื่อนไขและความคุ้มครองอย่างสมบูรณ์จะถูกระบุอยู่ในกรมธรรม์ที่ท่านซื้อไว้เท่านั้น\""
        ]
      }
    ]
}
