export default {
    "name": "โรคร้ายแรง รีฟันด์ พลัส",
    "info": null,
    "summary": [
      {
        "type": "item",
        "title": "ความคุ้มครอง",
        "items": [
          {
            "name": "1 กรณีเสียชีวิต ทุุกกรณี",
            "percentIncome": null,
            "income": "100,000"
          },
          {
            "name": "2 กรณีเสียชีวิต โดยอุบัติเหตุ(รับเพิ่มจากข้อ 1)",
            "percentIncome": null,
            "income": "500,000"
          },
          {
            "name": "3 กรณีเจ็บป่วยด้วยโรคร้ายแรง",
            "percentIncome": null,
            "income": null,
            "subItems": [
              {
                "name": "3.1 สำหรับการเจ็บป่วยด้วยโรคร้ายแรง* ต่อไปนี้",
                "percentIncome": null,
                "income": "{{income1}}"
              },
              {
                "name": "- โรคมะเร็งระยะลุกลาม",
                "percentIncome": null,
                "income": null,
                "indentLevel": 2
              },
              {
                "name": "- เนื้องอกในสมอง ชนิดที่ไม่ใช่มะเร็ง",
                "percentIncome": null,
                "income": null,
                "indentLevel": 2
              },
              {
                "name": "- กล้ามเนื้อหัวใจตายชนิดเฉียบพลันจากการขาดเลือด",
                "percentIncome": null,
                "income": null,
                "indentLevel": 2
              },
              {
                "name": "- การผ่าตัดเส้นเลือดเลี้ยงกล้ามเนื้อหัวใจ",
                "percentIncome": null,
                "income": null,
                "indentLevel": 2
              },
              {
                "name": "- โรคกล้ามเนื้อหัวใจ",
                "percentIncome": null,
                "income": null,
                "indentLevel": 2
              },
              {
                "name": "- การผ่าตัดลิ้นหัวใจโดยวิธีการเปิดหัวใจ",
                "percentIncome": null,
                "income": null,
                "indentLevel": 2
              },
              {
                "name": "- โรคหลอดเลือดสมองแตกหรืออุดตัน",
                "percentIncome": null,
                "income": null,
                "indentLevel": 2
              },
              {
                "name": "3.2 สำหรับการเจ็บป่วยด้วยโรคหลอดเลือดสมองโป่งพองที่ต้องรักษาโดยการผ่าตัด",
                "percentIncome": null,
                "income": "{{income2}}"
              },
              {
                "name": "3.3 โรคมะเร็งระยะไม่ลุกลามและโรคหลอดเลือดหัวใจตีบที่รักษาด้วยการสวนหลอดเลือดหัวใจ",
                "percentIncome": null,
                "income": "{{income3}}"
              },
            ]
          },
          {
            "name": "4 เงินชดเชยค่ารักษาพยาบาลรายวันต่อการเข้ารักษาตัวครั้งใดครั้งหนึ่ง วันละ (สูงสุดไม่เกิน 365 วัน)",
            "percentIncome": null,
            "income": "1,000"
          }
        ]
      },
      {
        type: "plain_text",
        text: "ผลประโยชน์จ่ายคืนเบี้ยประกันภัย\n" +
        "\tหากกรมธรรม์ประกันภัยมีผลบังคับอย่างต่อเนื่องตามระยะเวลาเอาประกันภัย 5 ปี โดยไม่มีการเรียกร้องสินไหมทดแทนตามผลประโยชน์ความคุ้มครองในข้อ 2 สำหรับการจ่ายเงินกรณีเสียชีวิตโดยอุบัติเหตุ และข้อ 3 สำหรับการจ่ายเงินกรณีเจ็บป่วยด้วยโรคร้ายแรง บริษัทฯ จะจ่ายคืนเบี้ยประกันภัยรายปีเป็นจำนวน 1 ปีในวันครบกำหนดสัญญา"
      },
      {
        "type": "note",
        "items": [
          {
            "iconText": "*",
            "color": "c-blue",
            "message": "หักด้วย จำนวนเงินผลประโยชน์การเจ็บป่วยด้วยโรคร้ายแรงตามข้อ 3.3 ที่บริษัทได้จ่ายให้แก่ผู้เอาประกันภัยไปแล้ว (ถ้ามี)"

          },
          {
            "iconText": "หมายเหตุ",
            "iconCss": "size-medium",
            "color": "c-blue",
            "message": "หมายเหตุ ผลประโยชน์ความคุ้มครองข้อ 3 จะสิ้นสุดลง เมื่อมีการจ่ายผลประโยชน์ตามข้อ 3.1 หรือ 3.2"
          }
        ]
      },
      {
        "type": "condition",
        "items": [
          "เพื่อสิทธิประโยชน์สูงสุดของท่าน ควรถือกรมธรรม์จนครบกำหนดสัญญา และผลประโยชน์ที่ได้รับจากกรมธรรม์ประกันชีวิตจะไม่มีการหักภาษีใดๆ ทั้งสิ้น และเป็นเงินปลอดหนี้ เจ้าหนี้ไม่มีสิทธิ์ยึดได้ ยกเว้นเท่าจำนวนเบี้ยประกันภัยที่จ่ายไปเท่านั้น",
          "การนำส่งเบี้ยประกันภัยเป็นหน้าที่ของผู้เอาประกันภัย การที่ตัวแทนประกันชีวิตเก็บเบี้ยประกันภัยเป็นการให้บริการเท่านั้น โดยท่าน สามารถชำระเบี้ยประกันภัยงวดต่อไปผ่านช่องทางต่างๆ เช่น สาขา, ที่ทำการไปรษณีย์, เคาน์เตอร์เซอร์วิส, ธนาคาร ฯลฯ หรือศึกษาข้อมูลเพิ่มเติมได้จากคู่มือผู้เอาประกันภัย",
          " ควรศึกษาข้อมูลก่อนการตัดสินใจ อีกทั้งต้องแถลงข้อมูลตามความเป็นจริงในเอกสารขอเอาประกันภัย เพื่อผลประโยชน์สูงสุดของท่าน \"เอกสารนี้เป็นเพียงการสรุปผลประโยชน์โดยสังเขป และขอสงวนสิทธิ์ในการพิจารณารับประกันตามหลักเกณฑ์ของบริษัทฯ ทั้งนี้เงื่อนไขและความคุ้มครองอย่างสมบูรณ์จะถูกระบุอยู่ในกรมธรรม์ที่ท่านซื้อไว้เท่านั้น\""
        ]
      }
    ],
    "calculate": (sum, prospect, utils, quatation) => {
      
      let fixpan = quatation.package == undefined || quatation.package == null ? 1 : quatation.package;
      let TE08_1 = "";
      let TE08_2 = "";
      let TE08_3 = "";

      if (fixpan == 1)
      {
        TE08_1 = "300000";
        TE08_2 = "150000";
        TE08_3 = "45000";
      }
      if (fixpan == 2)
      {
        TE08_1 = "500000";
        TE08_2 = "250000";
        TE08_3 = "75000";
      }
      if (fixpan == 3)
      {
        TE08_1 = "1000000";
        TE08_2 = "500000";
        TE08_3 = "150000";
      }
      const val0 = utils.numFormat(sum);
      const val1 = utils.numFormat(TE08_1);
      const val2 = utils.numFormat(TE08_2);
      const val3 = utils.numFormat(TE08_3);
      return {
        income1: val1,
        income2: val2,
        income3: val3
      }
    }
}