export default {
  "name": "กาย วีแคร์ ( Guy We Care)",
  "info": null,
  "summary": [
    {
      "type": "item",
      "title": "ความคุ้มครอง",
      "items": [
        {
          "name": "การสูญเสียชีวิต",
          "percentIncome": null,
          "income": "{{income1}}"
        },
        {
          "name": "โรคมะเร็งทุกชนิดทุกระยะ (ยกเว้นมะเร็งผิวหนัง)",
          "percentIncome": null,
          "income": "{{income2}}"
        },
        {
          "name": "การจ่ายเงินทดแทนเพิ่มสำหรับโรคมะเร็งต่อมลูกหมาก",
          "percentIncome": null,
          "income": "{{income3}}"
        },
        {
          "name": "โรคมะเร็งผิวหนัง",
          "percentIncome": null,
          "income": "{{income4}}"
        }
      ]
    },
    {
      "type": "condition",
      "items": [
        "เพื่อสิทธิประโยชน์สูงสุดของท่าน ควรถือกรมธรรม์จนครบกำหนกดสัญญา และผลประโยชน์ที่ได้รับจากกรมธรรม์ประกันชีวิตจะไม่มีการหักภาษีใดๆทั้งสิ้น และเป็นเงินปลอดหนี้เจ้าหนี้ไม่มีสิทธิ์ยึดได้ ยกเว้นเท่าจำนวนเบี้ยประกันภัยที่จ่ายไปเท่านั้น",
        "การนำส่งเบี้ยประกันภัยเป็นหน้าที่ของผู้เอาประกันภัย การที่ตัวแทนประกันชีวิตเก็บเบี้ยประกันภัยเป็นการให้บริการเท่านั้น โดยท่านสามารถชำระเบี้ยประกันภัยงวดต่อไปผ่านช่องทางต่างๆ เช่น สาขา, ที่ทำการไปรษณีย์, เคาน์เตอร์เซอร์วิส, ธนาคาร ฯลฯ หรือศึกษาข้อมูลเพิ่มเติมได้จากคู่มือผู้เอาประกันภัย",
        "ควรศึกษาข้อมูลก่อนการตัดสินใจ อีกทั้งต้องแถลงข้อมูลตามความเป็นจริงในเอกสารขอเอาประกันภัย เพื่อผลประโยชน์สูงสุดของท่าน \"เอกสารนี้เป็นเพียงการสรุปผลประโยชน์โดยสังเขป และขอสงวนสิทธิ์ในการพิจารณารับประกันตามหลักเกณฑ์ของบริษัทฯ ทั้งนี้เงื่อนไขและความคุ้มครองอย่างสมบูรณ์จะถูกระบุอยู่ในกรมธรรม์ที่ท่านซื้อไว้เท่านั้น\""
      ]
    }
  ],
  "calculate": (sum, prospect, utils, quatation) => {

    let fixpan = quatation.package == undefined || quatation.package == null ? 1 : quatation.package;
    let TE13_0 = ""
    let TE13_1 = "";
    let TE13_2 = "";
    let TE13_3 = "";
		
		if(fixpan == 1)
		{
      TE13_0 = "20,000";
			TE13_1 = "100,000";
			TE13_2 = "100,000";
			TE13_3 = "20,000";
		}
		if(fixpan == 2)
		{
      TE13_0 = "40,000";
			TE13_1 = "200,000";
			TE13_2 = "200,000";
			TE13_3 = "40,000";
		}
		if(fixpan == 3)
		{
      TE13_0 = "50,000";
			TE13_1 = "250,000";
			TE13_2 = "250,000";
			TE13_3 = "50,000";
		}
		if(fixpan == 4)
		{
      TE13_0 = "100,000";
			TE13_1 = "500,000";
			TE13_2 = "500,000";
			TE13_3 = "100,000";
    }
    
    return {
      income1: TE13_0,
      income2: TE13_1,
      income3: TE13_2,
      income4: TE13_3
    }
  }
}