export default {
  "name": "พี.เอ. สเปเชียลแคร์",
  "info": null,
  "summary": [
    {
      "type": "item",
      "title": "ความคุ้มครอง",
      "items": [
        {
          "name": "การเสียชีวิต สูญเสียอวัยวะ สายตา หรือทุพพลภาพถาวรสิ้นเชิง (DD&TPD)",
          "percentIncome": null,
          "income": "{{income1}}"
        },
        {
          "name": "การรักษาพยาบาลต่ออุบัติเหตุแต่ละครั้ง (ME)",
          "percentIncome": null,
          "income": "{{income2}}"
        },
        {
          "name": "ผลประโยชน์การทุพพลภาพชั่วคราวสิ้นเชิง (WI)",
          "percentIncome": null,
          "income": "{{income3}}"
        },
        {
          "name": "ขยายความคุ้มครอง การขับขี่หรือโดยสารรถจักรยานยนต์(MC)",
          "percentIncome": null,
          "income": "{{income4}}"
        },
        {
          "name": "ขยายความคุ้มครอง การถูกฆาตกรรมหรือถูกทำร้ายร่างกาย(MA)",
          "percentIncome": null,
          "income": "{{income5}}"
        }
      ]
    },
    {
      "type": "condition",
      "items": [
        "เพื่อสิทธิประโยชน์สูงสุดของท่าน ควรถือกรมธรรม์จนครบกำหนกดสัญญา และผลประโยชน์ที่ได้รับจากกรมธรรม์ประกันชีวิตจะไม่มีการหักภาษีใดๆทั้งสิ้น และเป็นเงินปลอดหนี้เจ้าหนี้ไม่มีสิทธิ์ยึดได้ ยกเว้นเท่าจำนวนเบี้ยประกันภัยที่จ่ายไปเท่านั้น",
        "การนำส่งเบี้ยประกันภัยเป็นหน้าที่ของผู้เอาประกันภัย การที่ตัวแทนประกันชีวิตเก็บเบี้ยประกันภัยเป็นการให้บริการเท่านั้น โดยท่านสามารถชำระเบี้ยประกันภัยงวดต่อไปผ่านช่องทางต่างๆ เช่น สาขา, ที่ทำการไปรษณีย์, เคาน์เตอร์เซอร์วิส, ธนาคาร ฯลฯ หรือศึกษาข้อมูลเพิ่มเติมได้จากคู่มือผู้เอาประกันภัย",
        "ควรศึกษาข้อมูลก่อนการตัดสินใจ อีกทั้งต้องแถลงข้อมูลตามความเป็นจริงในเอกสารขอเอาประกันภัย เพื่อผลประโยชน์สูงสุดของท่าน \"เอกสารนี้เป็นเพียงการสรุปผลประโยชน์โดยสังเขป และขอสงวนสิทธิ์ในการพิจารณารับประกันตามหลักเกณฑ์ของบริษัทฯ ทั้งนี้เงื่อนไขและความคุ้มครองอย่างสมบูรณ์จะถูกระบุอยู่ในกรมธรรม์ที่ท่านซื้อไว้เท่านั้น\""
      ]
    }
  ],
  "calculate": (sum, prospect, utils, quatation) => {
    //TODO: tfpan => แผน
    let fixpan = quatation.package == undefined || quatation.package == null ? 1 : quatation.package;

    let fixocc = prospect.occupationType;

    let TK2 = "";
    let TK3 = "";
    let TK4 = "";
    let TK5 = "";
    let TK6 = "";

    if (fixocc == "1" || fixocc == "2")
		{
			if (fixpan == "1")
			{
				TK2 = "1000000";
				TK3 = "100000";
				TK4 = "2000";
				TK5 = "500000";
				TK6 = "500000";
			}
			if (fixpan == "2")
			{
				TK2 = "2000000";
				TK3 = "100000";
				TK4 = "3000";
				TK5 = "1000000";
				TK6 = "1000000";
			}
			if (fixpan == "3")
			{
				TK2 = "3000000";
				TK3 = "150000";
				TK4 = "4000";
				TK5 = "1000000";
				TK6 = "1000000";
			}
			if (fixpan == "4")
			{
				TK2 = "4000000";
				TK3 = "200000";
				TK4 = "5000";
				TK5 = "1000000";
				TK6 = "1000000";
			}
			if (fixpan == "5")
			{
				TK2 = "5000000";
				TK3 = "200000";
				TK4 = "6000";
				TK5 = "1000000";
				TK6 = "1000000";
			}
		}

    return {
      income1: utils.numFormat(TK2),
      income2: utils.numFormat(TK3),
      income3: utils.numFormat(TK4),
      income4: utils.numFormat(TK5),
      income5: utils.numFormat(TK6)
    }
  }
}